projects/pokedex/index.html
<!-- Generated from fbf7e9e on 2023-11-27 @ 11:12 with Emacs 27.1 (Org mode 9.3) -->
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta author="J. Dylan White"/><meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/code.css"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/site.css"/><title>Pokedex - J. Dylan White</title></head><body><header class="site-header"><div class="container"><div class="site-title"><a class="site-name" href="/">J. Dylan White</a> </div></div><div class="site-masthead"><div class="container"><nav class="nav"><a class="nav-link" href="/">Home</a> <a class="nav-link" href="/projects/">Projects</a> <a class="nav-link" href="/dotfiles/">Dotfiles</a> </nav></div></div></header><div class="container"><div class="site-post"><h1 class="site-post-title">Pokedex</h1><p class="site-post-meta"></p><div id="content"><p>
Since I was a kid, I&rsquo;ve played several games in the Pokemon series. It&rsquo;s an iconic franchise, and one that I and many others have a lot of familiarity with. The Pokedex dataset is a fun dataset that gives me the opportunity to practice data science skills I&rsquo;ve learned, and the dataset generally follows some intuition developed with experience with the series.
</p>

<h2><a id="scraping-the-pokedex-data" class="anchor" href="#scraping-the-pokedex-data">¶</a>Scraping the Pokedex data</h2><div class="outline-text-2" id="text-org28ba549">
<p>
The <a href="https://pokemondb.net/">PokemonDB</a> site is a fantastic resource for getting information about various Pokemon. Whether you&rsquo;re just trying to casually play through any of the games or competitively build a team, this page has a lot of valuable information. From a data scraping perspective, there&rsquo;s an information page for each Pokemon generated from the games and other source material, and the information is often provided on the page in a structured way through various tables and containers on each page. I&rsquo;ve written code using R to scrape data from this site to build a Pokedex dataset so that we can explore the data and gain any interesting insights.
</p>

<ul class="org-ul">
<li><a href="scrape_specific_pokemon_data.html">Scraping individual Pokemon data</a> - investigating how to scrape Pokemon data for one specific Pokemon.</li>
<li><a href="scrape_initial_pokedex.html">Scraping initial Pokedex</a> - scraping the entire Pokedex, but just the names, numbers, and URLs.</li>
<li><a href="scrape_all_pokemon_data.html">Scraping all Pokemon data</a> - scraping stats and evolutionary data for all Pokemon.</li>
<li><a href="add_extra_pokedex_information.html">Adding extra Pokemon information</a> - adding generation and legendary status to existing Pokemon data.</li>
<li><a href="eda_physical_stats.html">Exploratory data analysis of physical stats</a> - investigating relationships associated to Pokemon&rsquo;s physical stats, namely height and weight.</li>
<li><a href="eda_types.html">Exploratory data analysis of type stats</a> - investigating Pokemon types and how battle stats vary by type.</li>
</ul>
</div>
</div></div></div><footer class="site-footer"><div class="container"><div class="row"><div class="column"><p><a href="https://github.com/jdylanwhite">GitHub</a> · <a href="https://www.linkedin.com/in/jdylanwhite5">LinkedIn</a> · <a href="mailto:jdylanwhite5@gmail.com">Email</a></p></div><div class="column align-right"><p><a href="https://github.com/jdylanwhite/jdylanwhite.github.io">Site Source</a></p></div></div></div></footer></body></html>
